package ru.skillfactory.module02.proj09;

/*
Создайте цикл, выводящий на экран четные цифры из диапазона от 2 до 10 включительно
 */

public class CycleFor {
    public static void main(String[] args) {
        for (int i = 2; i <= 10; i += 2) {
            System.out.println(i);
        }
    }
}
